{
 "adye1804": {
  "cms": "Adye, Ralph Willet.  <i>The Bombardier, and Pocket Gunner.</i>  Boston: E. Larkin, 1804.",
  "key": "adye1804",
  "ref": "Adye, 1804",
  "summary": "An alphabetical listing of information, largely compiled from sources at Woolwich."
 },
 "anderson1696": {
  "cms": "Anderson, Robert. <i>The Making of Rockets.</i>  London: Printed for Robert Morden, 1696",
  "details": "This short book is mostly concerned with making rockets and calculating distances and trajectories.  It includes information on how to pack them and to make pyrotechnic stars.\n\nThere is a short section on firing mortars, where the units are not specified very well.  My assumption is that some of the charges are in ounces avoirdupois, and that some of the others are in drams avoirdupois.  This seems appropriate from context, and the calculated power factors seem in line with other tests.  The distances are marked \"Chain\", but I presume them to be in links, not whole chains.\n",
  "key": "anderson1696",
  "ref": "Anderson, 1696",
  "summary": "Mostly a book on rockets, this also has some information on firing mortars."
 },
 "anderson1862": {
  "cms": "Anderson, Colonel William and Lieutenant-Colonel Samuel Parlby. <i>Sketch of the mode of manufacturing gunpowder at the Ishapore mills in Bengal.</i> London: John Weale, 1862",
  "details": "This book has fairly thorough details of the gunpowder mills in Ishapore.  Much of the work examines manufacturing parameters and how they effect the quality of the resulting gunpowder.\n\nAnderson gives pendulum eprouvette values for nearly all of the tests.  However, he mentions (p. 294) that \"The weight of the gun, length of the arms, centre of gravity, diameter of bore, and oscillation, are all elements in the calculation, and if these be not the same, not two \\u00e9pouvettes will give an equal arc with the same charge of powder.\"  He then goes on to say that he thinks a single eprouvette will give consistent results, but doesn't include the pertinent information for his eprouvette to allow calculation of power based on it.\n",
  "key": "anderson1862",
  "ref": "Anderson, 1862",
  "summary": "An excellent review of the technology used in India."
 },
 "annales1818": {
  "cms": "Gay-Lussac and Arago, <i>Annales de Chimie et de Physique, Tome Neuvième</i>, Paris: Crochard, 1818.",
  "key": "annales1818",
  "ref": "Gay-Lussac, 1818",
  "summary": "This contains a small article about on the speed of projectiles measured at Woolwich."
 },
 "bashforth1870": {
  "cms": "Bashforth, Francis.  <i>Reports on Experiments Made with the Bashforth Chronograph to determine the Resistance of the Air to the Motion of Projectiles, 1865-1870.</i>  London: W. Clowes and Sons, et al., 1870.",
  "details": "Bashforth's chronograph records time from a half-second pendulum on a moving piece of paper.  A series of frames with hanging wires are set up.  When the projectile passes these wires, a mark is made on the same paper as the time record, allowing for accurate time deltas to be determined.\n\nAlthough many of the experiments are done on ogival shot, many are also done on spherical shot.\n\n",
  "key": "bashforth1870",
  "ref": "Bashforth, 1870",
  "summary": "Bashforth invented a chronograph and measured the time of flight at multiple points along projectile trajectories for the purpose of determining air resistance."
 },
 "bashforth1890": {
  "cms": "Bashforth, Francis.  <i>A Revised Account of the Experiments made with the Bashforth Chronograph to find the Resistance of the Air to the Motion of Projectiles.</i>  Cambridge: At the University Press, 1890.",
  "key": "bashforth1890",
  "ref": "Bashforth, 1890",
  "summary": "This gives an exceelent account of how the chronograph works, repeats data from the 1870 volume, and presents tables and equations for calculating trajectories."
 },
 "benton1862": {
  "cms": "Benton, Capt. J. G.  <i>A Course of Instruction in Ordnance and Gunnery.</i>  New York: D. Van Norstand, 1862.",
  "key": "benton1862",
  "ref": "Benton, 1862",
  "summary": "The covers a wide range of topics in gunnery and artillery."
 },
 "berthelot1872": {
  "cms": "Berthelot, Marcelin.  <i>Sur la force de la poudre et matière explosives, Deuxième Édition</i>  Paris: Gauthier-Villars, 1872.",
  "details": "This calculates the chemical reactions of gunpowder.  Near the end there is a table of the heat output from a calorimeter.  In some ways this is the maximum amount of power that could be liberated from the gunpowder, as none of the energy escapes.  However, the available oxygen in the calorimeter is not reflective of actual available oxygen from air in a mortar or gun, and, since the gunpowder isn't expanding in the same manner, other differences exist.\n",
  "key": "berthelot1872",
  "ref": "Berthelot, 1872",
  "summary": "A chemical analysis of explosives with some measurements of released heat."
 },
 "berthelot1892": {
  "cms": "Berthelot, M., C. Napier Hake, trans., and William MacNab, trans.  <i>Explosives and Their Power: translated and condensed from the French of M. Berthelot.</i>  London: John Murray, 1892.",
  "details": "This includes a variety of sources of measuring the heat output of gunpowder using sealed calorimeters.  In some ways this is the maximum amount of power that could be liberated from the gunpowder, as none of the energy escapes.  However, the available oxygen in the calorimeter is not reflective of actual available oxygen from air in a mortar or gun, and, since the gunpowder isn't expanding in the same manner, other differences exist.\n\nThe authors find that the theoretical heat produced by gunpowder with pure carbon (rather than charcoal) would be lower than the realized values.\n",
  "key": "berthelot1892",
  "ref": "Berthelot, 1892",
  "summary": "A chemical analysis of explosives with some measurements of released heat."
 },
 "blondel1683": {
  "cms": "Blondel. <i>L'Art de Jetter les Bombes.</i>  Paris: Nicholas Langlois: 1683",
  "details": "This work compares a variety of theories of ballistics with the main focus being on throwing shells.  The author points out the absurdity of others' theories and promulgates his own, which is a variation of using a parabolic path.  He shows how this applies when the target is at a different elevation.\n\nAs part of showing other theories, he presents a theoretical table of ranges with varying angles of projection, plus a variety of results from different sources.\n\nThe author considers air resistance (see p. 336), but doesn't use it in the calculations.\n",
  "key": "blondel1683",
  "ref": "Blondel, 1683",
  "summary": "A book on throwing shells comparing various ballistic theories."
 },
 "bohn1988": {
  "cms": "Bohn, Dennis A. \"Environmental Effects on the Speed of Sound.\" <i>Journal of the Audio Engineering Society.</i> 36, no. 4 (April, 1988): 223-231.",
  "key": "bohn1988",
  "link": "http://www.rane.com/pdf/eespeed.pdf",
  "ref": "Bohn, 1988",
  "summary": "Used to calculate the speed of sound based on temperature and relative humidity."
 },
 "braddock1832": {
  "cms": "Braddock, John.  <i>A Memoir on Gunpowder; in which are distilled the Principles both of its Manufacture and Proof.</i>  London: J. M. Richardson, 1832.",
  "key": "braddock1832",
  "ref": "Braddock, 1832",
  "summary": "An account of gunpowder manufacture at Madras."
 },
 "buchanan1996": {
  "cms": "Buchanan, Brenda J.  <i>Gunpowder: The History of an International Technology. Claverton Down,</i> Bath: Bath University Press, 1996.",
  "details": "This book contains 24 articles by different authors on gunpowder.  Of these, only one contains numerical information that can be used for calculating power factors.  This is a report from 1815 comparing shipping gunpowder in wooden versus copper barrels, where the gunpowder is loading in March, 1814, shipped to India and back, and off-loaded in June, 1815.  The proof was measured on September 5, 1815.\n\nThe powder stored in wooden barrels degrades much more than that stored in copper.\n",
  "key": "buchanan1996",
  "ref": "Buchanan, 1996",
  "summary": "A report of comparing copper and wooden barrels from 1815."
 },
 "buchanan2006": {
  "cms": "Buchanan, Brenda, editor.  <i>Gunpowder, Explosives, and the State: A Technological History.</i>  Aldershot: Ashgate Publishing Limited, 2006",
  "key": "buchanan2006",
  "ref": "Buchanan, 2006",
  "summary": "A series of 20 essays on gunpowder."
 },
 "carmichael2003": {
  "cms": "Carmichael, Ralph. \"Trajectory of a baseball.\" Last modified February 7, 2003. http://www.pdas.com/programs/bb.f90",
  "key": "carmichael2003",
  "link": "http://www.pdas.com/atmos.html",
  "ref": "Carmichael, 2003",
  "summary": "I downloaded this program in 2003 and used it as an initial reference in calculating aerodynamic drag on spheres."
 },
 "chicago1993": {
  "cms": "University of Chicago Press. <i>The Chicago Manual of Style - 14th Edition.</i> Chicago: The University of Chicago Press, 1993.",
  "key": "chicago1993",
  "link": "http://www.chicagomanualofstyle.org/tools_citationguide.html",
  "ref": "Chicago, 1993",
  "summary": "I defer to the 14th edition when in doubt, since I own a copy"
 },
 "clarke1891": {
  "cms": "Clarke, F. W.  <i>Weights, Measures, and Money, of All Nations.</i>  New York: D. Appleton and Company: 1891.",
  "key": "clarke1891",
  "ref": "Clarke, 1891"
 },
 "collins2016": {
  "cms": "Collins, A. R. <i>SphereDrag.  Calculation of aerodynamic drag coefficient for a sphere at speeds near the speed of sound.</i>  Accessed April 29, 2016.  http://arc.id.au/CannonballDrag.html",
  "key": "collins2016",
  "link": "http://arc.id.au/CannonballDrag.html",
  "ref": "Collins, 2016",
  "summary": "This is a javascript program that calculates drag based on Reynolds and Mach numbers based on the paper from Miller.  It is a different implementation than I created and gives slightly different results."
 },
 "dantoni1765": {
  "cms": "d'Antoni, Alessandro Vittorio Papacino.  <i>Esame Della Polvere,</i> Torino: Nella Stamperia Reale, 1765.",
  "details": "This is a treatise on gunpowder in Italian by Alessandro Vittorio Papacino d'Antoni, the director of the Artillery School in Turin.\n\nStarting on page 210 (article 164), the author describes a very clever method of measuring the speed of a bullet.  A wheel has a rim of paper that sticks out on one side, and is sent spinning at a known rate.  A gun is fired such that the bullet passed along the diameter of the wheel, but next to it so that it pierces the paper at the two opposite rims without striking anything in between.  Knowing the speed of the wheel, you can see how much it has revolved between the bullet piercing the near and far points, from which you can calculate the time of transit.\n",
  "key": "dantoni1765",
  "ref": "d'Antoni, 1765",
  "summary": "A treatise on gunpowder and how it works chemically and physically."
 },
 "dantoni1780": {
  "cms": "d'Antoni, Alessandro Vittorio Papacino.  <i>Dell'Uso Delle Armi Da Fuoco,</i> Torino: Nella Stamperia Reale, 1780.",
  "details": "This is a treatise on gunpowder in Italian by Alessandro Vittorio Papacino d'Antoni, the director of the Artillery School in Turin.\n\nAs part of this treatise, the author discusses air resistance, including that it changes with elevation.\n",
  "key": "dantoni1780",
  "ref": "d'Antoni, 1780",
  "summary": "A treatise on fire arms."
 },
 "dantoni1789": {
  "cms": "d'Antoni, Alessandro Vittorio Papacino and Captain Thompson, trans.  <i>A Treatise on Gun-powder; a Treatise on Firearms; and a Treatise on the Service of Artillery in Time of War,</i> London: T. and J. Egerton, 1789.",
  "details": "This is a translation of three treatises from the Italian works of Alessandro Vittorio Papacino d'Antoni, the director of the Artillery School in Turin.  The translator notes (p. xxxiii) that \"All the weights and measures are reduced to the English standard: this, though a work of much labour, was deemed necessary; and indeed without it, a translation would be very defective.  The same denomination is left to the guns to distinguish their several natures, as in the original; it being found that they corresponded to natures unused among us and to fractional parts: it was therefore apprehended that the most simple mode was to leave the mas they were; the reader only having to recollect that the 32 pr. corresponds to the 27 pr. English; the 16 pr. to 13 1/2; the 8 pr. to 6 3/4; and the 4 pr. to 3 3/8.\"\n\nThe translator goes on to note that the Piedmontese artillerists use the Lypraund foot, and gives a conversion of 1 Lypraund foot is equal to 20.23457 English inches (p. xxxiv), and 1 Piedmontese pound is 13 oz 2 dr English, or 0.82 English pounds (p. xxxv).\n",
  "key": "dantoni1789",
  "ref": "d'Antoni, 1789",
  "summary": "A translation of three earlier works from the Italian."
 },
 "darcy1766": {
  "cms": "d'Arcy, M. le Chevalier.  <i>Essai d'Une Théorie d'Artillerie</i>  Dresde: George Conrad Walther: 1766.",
  "key": "darcy1766",
  "ref": "d'Arcy, 1766",
  "summary": "A treatise on gunpowder and artillery."
 },
 "diderot1751": {
  "cms": "Diderot and d'Alembert, ed. <i>Encyclopédie, ou Dictionanaire Raisonné des Sciences, des Arts et des Métiers, par une Société de Gens de Lettres.</i> Paris: Briasson, David, Le Breton, Durand: 1751",
  "key": "diderot1751",
  "link": "http://encyclopedie.uchicago.edu/",
  "ref": "Diderot, 1751",
  "summary": "This is an amazing compendium of knowledge.  It is one of the few mostly original encyclopedias."
 },
 "didion1857": {
  "cms": "Didion, Isidore.  <i>Lois de la Résistance de L'Air sur Les Projectiles.</i>  Paris: J. Dumaine, Juin 1857.",
  "details": "Didion produces equations for air resistance based on ball velocity, atmospheric density, and ball size.  He compares the results of his equations with the experimental data from Robin, Hutton, and Metz.  His final resistance equation is:\n\n$\\rho = 0.027 \\pi R^2 v^2 (1 + 0.0023 v)$  (p. 79)\n\nfor an atmospheric density of 1.2083 kg/m/m/m.\n",
  "key": "didion1857",
  "ref": "Didion, 1857",
  "summary": "Didion uses data from Robins, Hutton, and Metz to produce equations for air resistance."
 },
 "dupin1820": {
  "cms": "Dupin, Charles, <i>Force Miltaire de la Grande-Bretagne, Tome II</i>, Paris: Bachelier, 1820.",
  "key": "dupin1820",
  "ref": "Dupin, 1820",
  "summary": "This is the second volume of a work that recounts the military establishment in Great Britain."
 },
 "engineeringtoolbox": {
  "cms": "\"Metals and Alloys - Densities.\" Metals and Alloys - Densities. Accessed February 19, 2013. http://www.engineeringtoolbox.com/metal-alloys-densities-d_50.html.",
  "key": "engineeringtoolbox",
  "link": "http://www.engineeringtoolbox.com/metal-alloys-densities-d_50.html",
  "ref": "Engineering Toolbox",
  "summary": "A list of common material densities."
 },
 "gentlemans1740": {
  "cms": "Urban, Slyvanus.  \"Historical Chronical, Friday, 20\" <i>The Gentleman's Magazine and Historical Chronical</i>, 10, no. 6 (June 1740): 315.",
  "details": "This is a short article that compares English with captured Spanish gunpowder.  The full text is below:\n\nI assume that when *drams* are specified, that these are drams avoirdupois, and not Troy drams (the results are weak enough that the smaller unit seems more likely).\n\nThis powder gets terrible results, to the point that I suspect some gross error in the reported values.  The power between the lifting test and the swivel gun test is comparable, though.\n\n---\n\nFriday, 20.\n\nComplaint having been made to the Lords of the Admiralty that the Gunpowder used by the 3 Men of War when they took the *Princessa* was weaker than the Powder taken in the said Ship in Proportion of 7 to 12, it was thought proper to make a publick Tryal; in order thereto some Gunpowder was taken out of each of the above 4 Ships, put into 4 Boxes at Portsmouth which were seal'd up by some Officers of the Navy and Ordnance, and sent to Town, and this Day try'd at *Woolwich* before the D. of *Montagu* Master General of the Ordnance, Sir *Charles Wager*, Lord Vere *Beauclerk*, General *Borgard*, some Captains of Men of War, &c. in three divers Ways.  1. By raising a Weight of 20 l. 7 Ounces with two Drams of Powder.  2. By firing a twelve Pounder shot Shot out of a 5 2/3 Inch Mortar with a Quarter of an ounce of Powder.  3. By Firing a half-pounder Shot out of a Swivel Gun with two Drams of Powder.  In the first Experiment the *English* Powder raised the Weight from four Inches to six and some tenths, and the *Spanish* no higher than one Inch and 9 tenths: In proving by the Swivel Gun the *English* Powder threw the Ball 15 1/7 Foot at an Elevation of 61 Degrees, and the *Spanish* had not Strength enough to throw it out of the Gun; and the Tryal by the Mortar turn'd out equally in favour of the *English* Powder. --- *Notwithstanding the above Account, many Persons who have been at* Portsmouth *affirm that the Shot of the* Pricessa *were much Sharper thrown than those of our Men of War, some of hers going through the Sides of our Ships, when ours stuck in her Half-way.*\n\n",
  "key": "gentlemans1740",
  "link": "http://www.bodley.ox.ac.uk/cgi-bin/ilej/image1.pl?item=page&seq=4&size=1&id=gm.1740.6.x.10.x.x.315",
  "ref": "Gentleman's Magazine, 1740",
  "summary": "Some captured Spanish gunpowder is compared to some English gunpowder that was reputed to be worse."
 },
 "goex2019": {
  "cms": "\"Load Charts.\" Load Charts dated 2018-06. Accessed April 04, 2019. https://goexpowder.com/resources/load-charts/.",
  "key": "goex2019",
  "link": "https://goexpowder.com/resources/load-charts/",
  "ref": "Goex, 2019",
  "summary": "Expected loads from Goex."
 },
 "hall1997": {
  "cms": "Hall, Bert S.  <i>Weapons and Warfare in Renaissance Europe.</i>  Baltimore: The John Hopkins Press, 1997",
  "key": "hall1997",
  "ref": "Hall, 1997",
  "summary": "A good description of the use of early gunpowder weapons in Europe."
 },
 "haultain1861": {
  "cms": "Haultain, F. W., \"Remarks on the \"Report of Practice,\" carried on in 1858, in the Plumstead Marshes, with 9-pr. Field Guns, for the purpose of ascertaining the comparative merits of the 2 1/2 lbs., and 3 lbs. charges,\" <i>Minutes of Proceedings of the Royal Artillery Institution</i>, II (1861): 49-80",
  "key": "haultain1861",
  "ref": "Haultain, 1861",
  "summary": "This contains a report of some the ranges of some 800 shots with nine-pounder guns."
 },
 "hebert2019": {
  "cms": "\"The Power of Black Powder Revolvers: Black Powder vs. Substitutes\"  Accessed April 10, 2019. https://www.ammoland.com/2019/01/the-power-of-black-powder-revolvers-black-powder-vs-substitutes/.",
  "key": "hebert2019",
  "link": "https://www.ammoland.com/2019/01/the-power-of-black-powder-revolvers-black-powder-vs-substitutes/",
  "ref": "Hebert, 2019",
  "summary": "Various reported loads for pistols"
 },
 "helene1878": {
  "cms": "Hélène, Maxime.  <i>La Poudre a Canon et les Nouveaux Corps Explosifs.</i>  Paris: Librarie Hachette et Cie., 1878",
  "details": "This covers various aspects of ballistics, such as air resistance.  There are several experiments that provide power data.\n",
  "key": "helene1878",
  "ref": "Helene, 1878",
  "summary": "An overview of a variety of explosives."
 },
 "helie1865": {
  "cms": "Hélie.  <i>Traité de Balistique Expérimentle.</i>  Paris: Librarie Militaire, 1865.",
  "details": "This covers a history of gunpowder, various manufacturing techniques, proofing, and then goes on to dynamite, torpedoes, and other more modern items.\n\nThe author develops a third order equation to approximate aerodynamic drag on spherical projectiles, trying to fit it to experimental data.\n",
  "key": "helie1865",
  "ref": "Hélie, 1878",
  "summary": "A discussion of ballistics effects."
 },
 "henderson1976": {
  "cms": "Henderson, Charles B.  \"Drag Coefficients of Spheres in Continuum and Rarefied Flows.\"  AIAA Journal.  14, no. 6 (1976): 707-708.",
  "key": "henderson1976",
  "link": "http://arc.aiaa.org/doi/abs/10.2514/3.61409?journalCode=aiaaj",
  "ref": "Henderson, 1976",
  "summary": "Some equations for drag on spheres."
 },
 "hime1897": {
  "cms": "Hime, H. W. L., <i>Stray Military Papers</i>, London: Longmans, Green, and Co., 1897",
  "details": "This book includes a few historical references to older cannons and their ranges.\n",
  "key": "hime1897",
  "ref": "Hime, 1897",
  "summary": "This includes a chapter on field artillery and a section of proofs."
 },
 "hutton1778": {
  "cms": "Hutton, Charles.  \"The Force of Fired Gun-Powder, and the initial Velocities of Cannon Balls, determined by Experiments; from which is also deduced the Relation of the initial Velocity to the Weight of the sort and the Quantity of Powder.\" <i>Philosophical Transactions of the Royal Society of London,</i>, 68 (1778): 50-85.",
  "details": "Charles Hutton makes some experiments with two ballistic pendulums after the matter proposed by Benjamin Robins.  He attempts to determine the various sources of error and indicates that the results are probably accurate to 1 part in a few hundred.  The text describes the geometry of the pendulums fairly well.\n\nI have taken Hutton's computed velocities.  One could recompute them all, but I have not.\n\n",
  "key": "hutton1778",
  "ref": "Hutton, 1778",
  "summary": "Hutton's initial experiments with a ballistic pendulum."
 },
 "hutton1786": {
  "cms": "Hutton, Charles.  <i>Tracts, Mathematical and Philosophical.</i>  London: G. G. J. and J. Robinson, 1786",
  "key": "hutton1786",
  "ref": "Hutton, 1786",
  "summary": "Tract IX here is repeated in the 1812 multi-volume work as Tract XXXIV.  The data is recorded under those volumes, and therefore is skipped here."
 },
 "hutton1812v2": {
  "cms": "Hutton, Charles.  <i>Tracts on Mathematical and Philosophical Subjects, Vol. II.</i>  London: F. C. and J Rivington, et al., 1812",
  "details": "Although this book was published in 1812, the experiments described in Tract 34 were performed mostly in 1783.\n\nI have used the velocities as computed by Hutton, trusting that he has calculated the force on the pendulum appropriately.  Hutton shows on p. 25 in Vol. III that he would get the same results regardless of whether the gun is allowed to swing freely in recoil or not.\n\nThe tract has the virtue that it explains failures, rather than just reporting successful tests.\n\nOf further interest, Hutton shows the formula for the velocity of a bullet based on factors of a ballistic pendulum.  The end equation is on page 324.\n\n- $b$ - mass of the ball\n- $p$ - mass of the pendulum\n- $g$ - distance from the pendulum's pivot to the center of gravity\n- $o$ - distance to the center of oscillation (in modern terms, the center of percussion).  This can be computed from the period, $T$ as $o = \\dfrac{T^2 G}{4 \\pi^2}$ where $G$ is the acceleration of gravity.\n- $i$ - distance to the point of impact\n- $c$ - length of the chord of the pendulum's movement\n- $r$ - distance to the measurement chord (the radius)\n- $v$ - the velocity of the ball\n\n$v = \\dfrac{\\sqrt G c}{b i r}\\sqrt{(p g o + b i i)(p g + b i)}$\n",
  "key": "hutton1812v2",
  "ref": "Hutton, 1812, Vol. II",
  "summary": "Tract XXXIV: New Experiments in Gunnery; for Determining the Force of Fired Gunpowder, the initial velocity of cannon balls, the ranged of projectiles at different elevations, the resistance of air to projectiles, the effect of different lengths of guns, and of different quantities of powder, &c, &c."
 },
 "hutton1812v3": {
  "cms": "Hutton, Charles.  <i>Tracts on Mathematical and Philosophical Subjects, Vol. III.</i>  London: F. C. and J Rivington, et al., 1812",
  "details": "This is a continuation of Vol. II, and contains experiments from 1784 through 1791 (at least).\n\nI have used the velocities as computed by Hutton, trusting that he has calculated the force on the pendulum appropriately.  Hutton shows on p. 24 that he would get the same results regardless of whether the gun is allowed to swing freely in recoil or not.\n\nHutton discusses calculating the range of projectiles and concludes that it is very difficult because of air resistance varying based on the density, size, and speed of the projectile, and on the pressure, temperature, and altitude of the environment.\n\nHutton calculates the maximum velocity a gun of different lengths can throw a projectile (see p. 313).  He notes that using spherical projectiles is a limiting factor.\n",
  "key": "hutton1812v3",
  "ref": "Hutton, 1812, Vol. III",
  "summary": "Tract XXXIV, continued.  Tract XXXV: On a new Gunpowder Eprouvette.  Tract XXXVI: Determination of the Air's Resistance to Bodies in motion, as determined by the Whirling Machine.  Tract XXXVII: On the theory and Practice of Gunnery, as dependent on the Resistance of the Air."
 },
 "hutton1815v1": {
  "cms": "Hutton, Charles.  <i>A Philosophical and Mathematical Dictionary, Vol. I</i>  London: F. C. and J Rivington, et al., 1815.",
  "key": "hutton1815v1",
  "ref": "Hutton, 1815",
  "summary": "A lengthy series of articles.  That on Gunnery contains some decent historical notes and a summary table of a some experiments.  Volume II (p. 561) contains a table comparing results fro ma double pendulum but without enough data to produce a useful computation."
 },
 "international1909": {
  "cms": "VIIth International Congress of Applied Chemistry, Explosives Section, <i>The Rise and Progress of the British Explosives Industry.</i>  London: Whittaker and Co.: 1909",
  "details": "This is a history of the British explosives industry.  There is a chapter with the history of gunpowder by E. A. Brayley Hodgetts, and a chapter about gunpowder research by G. W. MacDonald.  The chapter on research has a small summary of early test results.\n\nAlthough the text cites results by Robins and Hutton, the one by Robins must contain some sort of error, as the power factor computed for the gun powder is very low.  The results from Hutton are incomplete and insufficient for calculation.\n",
  "key": "international1909",
  "ref": "International Congress, 1909",
  "summary": "A history of the explosives industry with a chapter about researches on gunpowder by G. W. MacDonald."
 },
 "kadoya1985": {
  "cms": "Kadoya, K., N. Matsunaga, and A. Nagashima. \"Viscosity and Thermal Conductivity of Dry Air in the Gaseous Phase.\" <i>Journal of Physical and Chemical Reference Data.</i> 14, no. 4 (1985): 947-970.",
  "key": "kadoya1985",
  "link": "http://www.nist.gov/data/PDFfiles/jpcrd283.pdf",
  "ref": "Kadoya, 1985",
  "summary": "Used to determine the viscosity of dry air."
 },
 "kempers1998": {
  "cms": "Kempers, R. T. W., <i>Eprouvettes: A Comprehensive Study of Early Devices for the Testing of Gunpowder</i>, Leeds: Royal Armouries Museum, 1998.",
  "key": "kempers1998",
  "ref": "Kempers, 1998",
  "summary": "A well-produced study of eprouvettes."
 },
 "krenn1995": {
  "cms": "Krenn, Peter; Kalaus, Paul; Hall, Bert.  \"Material Culture and Military History: Test-Firing Early Modern Small Arms.\" <i>Material Culture Review / Revue de la culture matérielle, [S.l.], June 1995</i>.  ISSN 1927-9264.  Accessed: August 27, 2016.  https://journals.lib.unb.ca/index.php/MCR/article/view/17669/22312",
  "key": "krenn1995",
  "link": "https://journals.lib.unb.ca/index.php/MCR/article/view/17669/22312",
  "ref": "Krenn, 1995",
  "summary": "Ballistics tests with early weapons using modern gunpowder."
 },
 "lewes1920": {
  "cms": "Lewes, Vivian B. and J. S. S. Brame.  <i>Service Chemistry, being a short manual of chemistry and metallurgy and their application in the naval and military service.</i>  London: Edward Arnold, 1920.",
  "details": "This book has an overview of various chemical reactions.  It has a nice summary of prismatic and cocoa powders, how mechanical pressure gauges work, and how an electric chronograph works.\n",
  "key": "lewes1920",
  "ref": "Lewes, 1920",
  "summary": "A few calorimeter results are listed."
 },
 "lombard1796": {
  "cms": "Lombard, Jean-Antoine-Marie,  <i>Traité du Mouvement des Projectiles, appliqué au Tir des Bouches a Feu.</i>  Dijon: L. N. Frantin, An V (1796).",
  "key": "lombard1796",
  "ref": "Lombard, 1796",
  "summary": "This gives equations for calculating trajectories."
 },
 "lyman1975": {
  "cms": "Ramage, C. Kenneth, editor, <i>Lyman Black Powder Handbook</i>, Middlefield, CT: Lyman Publications, 1975.",
  "key": "lyman1975",
  "ref": "Lyman, 1975",
  "summary": "This is a guide for shooters and hunters.  Their load charts are based on firing a series of bullets and averaging them.  They also have trajectory charts based on a ballistics model.  It seems that each firearm was measured multiple times, avereraged, and then muzzle velocities were computed based on that average, a ballistic coefficient for round ball, and a ballistic modelling program."
 },
 "maxwell1870": {
  "cms": "Maxwell, H. H., \"The New Field Artillery of Mattei-Rossi.  Translated from the Italian of \"L'Opinione,\" 23rd-26th October 1868,\" <i>Minutes of Proceedings of the Royal Artillery Institution</i>, VI (1870): 325-334",
  "key": "maxwell1870",
  "ref": "Maxwell, 1870",
  "summary": "This contains a brief mention of a gun's initial velocity."
 },
 "meigs1883": {
  "cms": "Meigs, Lieutenant U.S.N, translated from Sarrau, M. E. <i>Theoretical Researches on the Effects of Gunpowder and Other Explosives</i>  Washington: Government Printing Office, 1883.",
  "key": "meigs1883",
  "ref": "Meigs, 1883",
  "summary": "Mostly calculated values with a few results from calorimeters."
 },
 "melling1997": {
  "cms": "Melling, Adrian, Stefan Noppenberger, Martin Still, and Holger Venzke. \"Interpolation Correlations for Fluid Properties of Humid Air in the Temperature Range 100 C to 200 C.\" <i>Journal of Physical and Chemical Reference Data.</i> 26, no. 4 (1997): 1111-1123.",
  "key": "melling1997",
  "link:": "http://www.nist.gov/data/PDFfiles/jpcrd526.pdf",
  "ref": "Melling, 1997",
  "summary": "The contains the equation used to combine the viscosities of dry air and water vapor to determine the viscosity of humid air."
 },
 "miller1979": {
  "cms": "Miller, Donald G., and Allan B. Bailey. \"Sphere drag at Mach numbers from 0.3 to 2.0 at Reynolds Numbers approaching 10^7.\" <i>Journal of Fluid Mechanics.</i> 93, no. 3 (1979): 449-464.",
  "key": "miller1979",
  "ref": "Miller, 1979",
  "summary": "This is the best source I found for coefficient of drag based on Reynolds and Mach numbers in the range of typical projectiles."
 },
 "modern2019": {
  "cms": "\"Modern Muzzleloader.\" Accessed April 3, 2019. https://www.modernmuzzleloader.com.",
  "key": "modern2019",
  "link": "https://www.modernmuzzleloader.com",
  "ref": "Modern Muzzleloader, 2019",
  "summary": "Various reports of black powder tests."
 },
 "montagu1792": {
  "cms": "Montagu, George, <i>The Sportsman's Directory, or Tractate on Gunpowder</i>, London: R. Faulder, 1792",
  "details": "The author compares different powder and comments on what he thinks is the best to use for shooting birds.  His tests use a very short barreled mortar, which shows fine powder to advantage, as the large powder doesn't have a chance to combust before the ball has moved.\n\nOn p. 28, the author mentions glazing powder with black-lead.  This is the earliest reference to graphite glazing that I have found.\n",
  "key": "montagu1792",
  "ref": "Montagu, 1792",
  "summary": "The author tests different powders with the desire to find the best sporting powder."
 },
 "mordecai1845": {
  "cms": "Mordecai, Alfred, <i>Report of Experiments on Gunpowder, made at Washington Arsenal, in 1843 and 1844</i>, Washington: J. and G. S. Gideon, 1845.",
  "details": "The author was asked to erect at Washington Arsenal a ballistic pendulum, and a gun pendulum, to serve for experiments in gunnery and also for the proof of gunpowder.\n\nThe beginning of the volume has an excellent description of the pendulums used, how the guns are loaded, and how the system is maintained.\n\nOverall the experiments are wide-ranging, carefully performed, and quite illuminating.  Only testing powder in the intended weapons fully reveals what is most appropriate.  Using blanks in an eprouvette does not show the relative merits of power in long-arms, mortars, or cannons.\n",
  "key": "mordecai1845",
  "ref": "Mordecai, 1845",
  "summary": "The first of two large sets of experiments on gunpowder."
 },
 "mordecai1849": {
  "cms": "Mordecai, Alfred, <i>Second Report of Experiments on Gunpowder, made at Washington Arsenal, in 1845, '47, and '48</i>, Washington: J. and G. S. Gideon, 1849.",
  "details": "This is a set of continued trials, which, in part, is meant to determine the smallest cannon which can be used to prove gunpowder for use in large cannons.\n",
  "key": "mordecai1849",
  "ref": "Mordecai, 1849",
  "summary": "The second of two large sets of experiments on gunpowder."
 },
 "moretti1673": {
  "cms": "Moretti, Tomaso.  <i>A General Treatise of Artillery: or Great Ordnance.  Translated into English by Sir Jonas Moore</i>  London: William Godbid, 1673.",
  "key": "moretti1673",
  "ref": "Moretti, 1673",
  "summary": "The peculiar treatise has commentary about a bridge interspersed between sections on artillery."
 },
 "morrison2013": {
  "cms": "Morrison, Faith A.  <i>Data Correlation for Drag Coefficient for Sphere.</i>  Accessed April 29, 2016.  http://www.chem.mtu.edu/~fmorriso/DataCorrelationForSphereDrag2013.pdf",
  "key": "morrison2013",
  "link": "http://www.chem.mtu.edu/~fmorriso/DataCorrelationForSphereDrag2013.pdf",
  "ref": "Morrison, 2013",
  "summary": "This has an equation for the Coefficient of drag based on the Reynolds number, but it only applies at low speeds."
 },
 "muller1780": {
  "cms": "Muller, John, <i>A Treatise of Artillery</i>, London: John Miller, 1780.",
  "details": "In the introduction, Muller gives some historical data.  He oddly criticizes Robins, including calling into question some of the measurements made with the ballistic pendulum.  Muller gives a table on p. xxxviii claiming that certain size balls cannot exceed certain initial velocities or ranges, without using experiments to back this up.  As this is not supported by any other researcher's data, it makes all of Muller's theory questionable.  As Muller published well-regarded books on fortifications, this is surprising.\n",
  "key": "muller1780",
  "ref": "Muller, 1780",
  "summary": "This is a general account of artillery construction and management."
 },
 "munson1998": {
  "cms": "Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. <i>Fundamentals of Fluid Mechanics, Third Edition.</i> New York: John Wiley & Sons, Inc., 1998.",
  "key": "munson1998",
  "ref": "Munson, 1998",
  "summary": "A general text book."
 },
 "namlhunt2019": {
  "cms": "\"North America's No. 1 Muzzleloading Website.\"  Accessed April 04, 2019. http://www.namlhunt.com/.",
  "key": "namlhunt2019",
  "link": "http://www.namlhunt.com/",
  "ref": "NAML, 2019",
  "summary": "Various reported loads."
 },
 "noble1870": {
  "cms": "Noble, W. H., \"Extracts from Report on Ballistic Experiments Carried on During the Years 1861-2, Under the Direction of the O.S. Committee,\" <i>Minutes of Proceedings of the Royal Artillery Institution</i>, VI (1870): 9-18",
  "key": "noble1870",
  "ref": "Noble, 1870",
  "summary": "This has a nice historic overview of measuring projectile velocities."
 },
 "noble1875": {
  "cms": "Noble, Captain, and F. A. Abel,  \"Researches on Explosives.  Fired Gunpowder.\" <i>Philosophical Transactions of the Royal Society of London</i>, Vol. 165 (1875): 49-155.",
  "details": "This is a excellent summary of research into how gunpowder explodes.  In addition to calorimetric data, Noble and Abel calculate the amount of work that gunpowder can produce given volumetric expansion (related to the length of the gun in calibers).\n",
  "key": "noble1875",
  "ref": "Noble, 1875",
  "summary": "Analysis of gunpowder force and chemistry."
 },
 "noble1880": {
  "cms": "Noble, Captain, and F. A. Abel,  \"Researches on Explosives.  No. II.  Fired Gunpowder.\" <i>Philosophical Transactions of the Royal Society of London</i>, Vol. 171 (1880): 203-279.",
  "details": "This is a second set of experiments into how gunpowder explodes which addresses some limitations on the 1875 experiments.\n",
  "key": "noble1880",
  "ref": "Noble, 1880",
  "summary": "Analysis of gunpowder force and chemistry."
 },
 "norwest2001": {
  "cms": "\"Practical Chronographic Comparison of Goex, KIK and Elephant Brand of Black Powder.\" Comparing Goex, KIK and Elephant Brands of Black Powder. Accessed February 28, 2005. http://www.norwestcompany.com/comparison.htm.",
  "details": "A comparison of three brands of black powder was made using four different longarms.  Goex, KIK, and Elephant brands were compared, all in FFg granulation.  The results are presented for each brand and gun.\n\nFive rounds were used with each gun and powder combination.  The projectile velocity was measured 20 feet in front of the firing line using a chronograph.  The average, high, and low velocities were reported for each set of five rounds.\n\nThe tests are reported to have been conducted with a temperature in mid-50s and a high relative humidity.  I have arbitrarily chosen to list the temperature as 55&deg;F, and the relative humidity as 90 %, as historically that appears to be the rough average for the week the tests were conducted.\n\n",
  "key": "norwest2001",
  "link": "http://www.norwestcompany.com/comparison.htm",
  "ref": "Norwest, 2001",
  "summary": "A modern comparison of different brands of black powder used in smoothbore and rifle longarms."
 },
 "ordnance1850": {
  "cms": "<i>The Ordnance Manual for the Use of the Officers of the United States Army, Second Edition.</i>  Washington: Gideon &amp; Co., 1850.",
  "key": "ordnance1850",
  "ref": "Ordnance Manual, 1850",
  "summary": "This covers many aspects of inspecting and maintaining artillery."
 },
 "parish1977": {
  "cms": "Parish, O. Owen and Terril W. Putnam. <i>Equations for the Determination of Humidity from Dewpoint and Psychrometric Data.</i>  Washington, D.C.: National Aeronautics and Space Administration, 1977.",
  "key": "parish1977",
  "ref": "Parish, 1977",
  "summary": "Equations for calculating humidity."
 },
 "partington1999": {
  "cms": "Partington, J. R., <i>A History of Greek Fire and Gunpowder</i>, Baltimore: The Johns Hopkins University Press, 1999.",
  "key": "partington1999",
  "ref": "Partington, 1999",
  "summary": "Originally published in 1960, this work has copious information, though many of the references are to the author's own publications, making the quality of them hard to evaluate."
 },
 "picard2008": {
  "cms": "Picard, A., R. S. Davis, M. Gläser, and K. Fujii. \"Revised formula for the density of moist air (CIPM-2007).\" <i>Metrologia.</i> 45 (2008): 149-155.",
  "key": "picard2008",
  "link": "http://stacks.iop.org/Met/45/149",
  "ref": "Picard, 2008",
  "summary": "A good summary of the errors in computing atmospheric density while taking humidity into account."
 },
 "piobert1836": {
  "cms": "Piobert, Guillaume, <i>Traité D'Artillerie Théorique et Practique</i>, Paris: Leneveu, 1836.",
  "details": "This work has a great compendium of accuracy tables of different small and large arms.  \n\nMany of the range tables for artillery pieces list angles precise to the arcsecond.  These angles include the drop of the land between the location of the artillery piece and the point of impact.  Rather than measuring the angle of the artillery piece this precisely, some coarser measurement has been used and then an angle has been added to account for the fall.  It would have been preferable to have reported the difference in height from the artillery piece and the impact.\n",
  "key": "piobert1836",
  "ref": "Piobert, 1836",
  "summary": "Extensive information on the accuracy of different guns.  The data was collected over decades; much is references from the 1810s."
 },
 "piobert1844": {
  "cms": "Piobert, Guillaume, <i>Mémoires sur les Poudres de Guerre des Différents Procédés de Fabrication</i>, Paris: Bachelier, 1844.",
  "key": "piobert1844",
  "ref": "Piobert, 1844",
  "summary": "This compares gunpowder from different manufacturers based on trials in the 1830s."
 },
 "report1742": {
  "cms": "Committee of the Royal Society. \"Report of the Committee of the Royal Society appointed to examine some Questions in Gunnery.\" <i>Philosophical Transactions of the Royal Society</i>, XVII, no. 465 (October and November 1742): 172-183.",
  "details": "This is a report from a group instructed to determine if all gunpowder is burnt when firing a gun, and also if all of the gunpowder has fired (inflamed) before the bullet has moved a significant distance.  Since not all of the gunpowder is burnt, they also conclude that it doesn't happen instantaneously.  As a follow up to this, they test how different short barrel lengths affect the range of a mortar.\n\nFor this purpose, the committee had made three inserts that would fit into a mortar.  Each insert had a cylindrical powder chamber that held one ounce Troy of powder, but had different lengths and diameters.  Specifically, the chamber lengths were 3 inches, 1 1/2 inches, and 3/4 inch.  A few tests are made with each chamber.\n",
  "key": "report1742",
  "link": "http://rstl.royalsocietypublishing.org/content/by/year",
  "ref": "Committee of the Royal Society, 1742",
  "summary": "The committee analyzes how much gunpowder remains unburnt after firing and what effect chamber length has on range."
 },
 "rice2018": {
  "cms": "\"Velocity Test\"  Accessed April 10, 2019. https://www.ricebarrels.com/velocity%20test.html.",
  "key": "rice2018",
  "link": "https://www.ricebarrels.com/velocity%20test.html",
  "ref": "Rice, 2018",
  "summary": "Velocity for different barrel lengths"
 },
 "roberts2008": {
  "cms": "Roberts, N. A., J. W. Brown, B. Hammett, and P. D. F. Kingston, \"A Detailed Study of the Effectiveness and Capabilities of 18th Century Musketry on the Battlefield,\" <i>Bastions and Barbed Wire</i>, Leiden: Brill (2008): 1-23",
  "key": "roberts2008",
  "ref": "Roberts, 2008",
  "summary": "This uses a simulated Brown Bess and a mix of modern powders to study the effects of musket fire."
 },
 "robertson1775": {
  "cms": "Robertson, John, <i>A Treatise of Mathematical Instruments</i>, originally published London: printed for J. Nourse, 1775, reprinted by Arlington, VA: The Invisible College Press, 2002.",
  "details": "This is a textbook prepared by the master of the Royal Mathematical School in Christ's Hospital, updated through several editions for use by the Naval Academy in Portsmouth.\n\nA set of example problems are given on calculating range, angle of elevation, and powder charge using a 24 lb cannon.  The primary example uses unrealistic numbers, which almost would make sense if Mach effects didn't exist.  All of the other examples are based on this first unrealistic one, so are similarly unbelievable.\n",
  "key": "robertson1775",
  "ref": "Robertson, 1775",
  "summary": "Textbook problems with an unrealistic starting condition."
 },
 "robins1742": {
  "cms": "Robins, Benjamin.  <i>New Principles of Gunnery: containing The Determination of the Force of Gun-Powder and An Investigation of the Difference in the Resitsing Power of the Air to Swift and Slow Motions</i>  London: J. Nourse, 1742",
  "details": "This work introduces the ballistic pendulum, but also attempts to develop a working formula for air resistance.  Robins points out that projectiles don't travel in parabolas because of air resistance\n",
  "key": "robins1742",
  "ref": "Robins, 1742",
  "summary": "This is the original publication that described the ballistic pendulum."
 },
 "robins1761v1": {
  "cms": "Robins, Benjamin.  <i>Mathematical Tracts of the late Benjamin Robins, Esq, Vol. I</i>  London: J. Nourse, 1761",
  "details": "This is a set of collected works of the inventor of the ballistic pendulum.  As the inventor, some of Robins' notations and work is more cumbersome than later authors.  He will cite the rate of a pendulum in oscillations per time, where an oscillation is either back or forth.  Hutton refers to this as a \"small oscillation\" to distinguish it from a full oscillation which is both back-and-forth.\n\nThe first 153 pages of this volume are the contents of _New Principles of Gunnery_, Robins, 1742 (though retypeset and with some footnotes by the editor).  The data from that section has not been repeated.\n\nRobins tries to produce a formula for the resistance of the air.  His force of drag is proportionate to the square of the velocity up to around 1200 ft/s, after which he arbitrarily multiples that squared amount by a further factor of three.\n",
  "key": "robins1761v1",
  "ref": "Robins, 1761, Vol. I",
  "summary": "This is a collected set of Robins' works published by James Wilson, M.D."
 },
 "robins1805": {
  "cms": "Robins, Benjamin.  <i>New Principles of Gunnery: A New Edition with by Charles Hutton</i>  London: F. Wingrave, 1805",
  "key": "robins1805",
  "ref": "Robins, 1805",
  "summary": "A new edition of the book by the inventor of the ballistic pendulum."
 },
 "roux1873": {
  "cms": "Roux and Sarrau. \"Recherches expérimentals sue les matières explosives,\" <i>Comptes Rendus Hebdomadaires des Séances de l'Académie des Sciences,</i> LXXVII (1873): 478-481.",
  "key": "roux1873",
  "ref": "Roux, 1873",
  "summary": "Force of power measured via calorimeter."
 },
 "rumford1797": {
  "cms": "Rumford, Benjamin Count of.  \"Experiments to determine the Force of fired Gunpowder.\" <i>Philosophical Transactions of the Royal Society of London,</i>, 87 (1797): 222-292.",
  "details": "The pressure developed by gunpowder is measured by having a small strong barrel filled with gunpowder and measure the smallest weight that, sitting on top of the vertical barrel, will just barely be moved.  Rumford uses a piece of ordnance for this weight, standing it on its cascabel.\n",
  "key": "rumford1797",
  "ref": "Rumford, 1797",
  "summary": "Count Rumford measures the pressure developed by gunpowder."
 },
 "scott2017": {
  "cms": "Scott, Douglas D., Joel Bohy, Nathar Boor, Charles Haeker, William Rose, and Patrick Severts, <i>Colonial Era Firearm Bullet Performance: A Live Fire Experimental Study for Archeological Interpretation</i>, http://www.modernheritage.net/Scott_etal_2017.pdf, accessed April 6, 2019, dated April 2017.",
  "key": "scott2017",
  "link": "http://www.modernheritage.net/Scott_etal_2017.pdf",
  "ref": "Scott, 2017",
  "summary": "An extensive experiment on the effects of musketry."
 },
 "sengers1984": {
  "cms": "Sengers, J. V. and B. Kamgar-Parsi. \"Representative Equations for the Viscosity of Water Substance.\" <i>Journal of Physical and Chemical Reference Data. 13, no. 1 (1984): 185-205.</i>",
  "key": "sengers1984",
  "link": "http://www.nist.gov/data/PDFfiles/jpcrd243.pdf",
  "ref": "Sengers, 1984",
  "summary": "Used to determine the viscosity of water vapor."
 },
 "smith1779": {
  "cms": "Smith, George.  <i>An Universal Military Dictionary,</i>  London: J. Millan, 1779",
  "details": "Curiously, the velocities listed for the experiments by Robins do not match the values reported by Hutton, 1778.  In general, those reported by Smith a slightly higher than the ones in Hutton.  The charge weights and diameters appear to match, however.\n",
  "key": "smith1779",
  "ref": "Smith, 1779",
  "summary": "Many miltary subjects are discussed in brief.  The section on gunnery has a summary of Robins ballistic pendulum work."
 },
 "steele2005": {
  "cms": "Steele, Brett D. and Tamera Dorland, editors.  <i>The Heirs of Archimedes: Science and the Art of War through the Age of Enlightenment.</i>  Cambridge: The MIT Press, 2005.",
  "key": "steele2005",
  "ref": "Steele, 2005",
  "summary": "A series of 13 essays, 3 of which are on gunpowder."
 },
 "steerk1866": {
  "cms": "Steerk, <i>Guide Pratique de la Fabrication des Poudres et Salpêters</i>.  Paris: Libraire de la Société des Ingénieurs Civils, 1866",
  "key": "steerk1866",
  "ref": "Steerk, 1866",
  "summary": "This work discusses many aspects of making gunpowder, all the way from refining ingredients to proof."
 },
 "stone1758": {
  "cms": "Stone, Edmund, <i>The Construction and Principal Uses of Mathematical Instruments, translated from the French of M. Bion</i>, originally published Lonndon: printed for J. Richardson, 1758, reprinted by Mendham, NJ: Astragal Press, 1995.",
  "key": "stone1758",
  "ref": "Stone, 1758",
  "summary": "Many conversion factors for lengths of different locations in Europe."
 },
 "straith1850": {
  "cms": "Straith, Hector, <i>Treatise on Fortification and Artillery</i>, London: W. Allen and Company, 1850.",
  "details": "This book includes a section on gunpowder manufacturing in India.  It has a section on proof requirements using mortars, a pendulum eprouvettes, a rifle eprovette fired through a number of wooden boards, and several other methods.  Only the first tests have enough information to calculate power factors.\n\nThe section on using pendulum eprovettes suggests that such an eprovette doesn't always give accurate results.  In this, a charge is loaded into a pendulum-hanging gun, and the arc of recoil  is measured.  Here the powder is acting more like a rocket, and is not used to fire a projectile.  Without knowing the length of the pendulum arm, the data is insufficient to calculate power generated by the gunpowder.\n",
  "key": "straith1850",
  "ref": "Straith, 1850",
  "summary": "Observations based on the author's experience in India."
 },
 "stremy1745": {
  "cms": "Saint-Remy, Surirey de. <i>Memoires d'Artillerie, Troisiéme Edition.</i> Paris: Charles-Antoine Jombert, 1745.",
  "key": "stremy1745",
  "ref": "Saint-Remy, 1745",
  "summary": "An amazing compendium listing how to make and refine saltpetre, giving dimensions of stamp mills, and good details on the whole of the manufacturing."
 },
 "stremy1745v2": {
  "cms": "Saint Remy, M. Surirey de, <i>Memoires d'Artillerie, Recuellís par M. Surirey de Saint Remy, Lieutenant du Grand-Maítre de l'Artillerie de France.  Troisiíme Edition, Tome Second.</i>, Paris: Chez Rollin Fils, 1745.",
  "key": "stremy1745v2",
  "ref": "Saint Remy, 1745, Vol. II",
  "summary": "A complete summary of artillery in France."
 },
 "subramanian2005": {
  "cms": "Subramanian, R. Shankar. <i>Drag on spherical particles and steady settling velocities.</i> Accessed February 7, 2005.  http://web2.clarkson.edu/projects/subramanian/ch330/notes/Drag%20on%20a%20Sphere.pdf",
  "key": "subramanian2005",
  "link": "http://web2.clarkson.edu/projects/subramanian/ch330/notes/Drag%20on%20a%20Sphere.pdf",
  "ref": "Subramanian, 2005"
 },
 "thompson1781": {
  "cms": "Thompson, Benjamin.  \"New Experiments upon Gun-Powder, with Occasional Observations and Practical Inferences; To Which are Added, an Account of a New Method of Determining the Velocities of All Kinds of Military Projectiles, and the Description of a Very Accurate Eprouvette for Gun-Powder.\" <i>Philosophical Transactions of the Royal Society of London,</i>, 71 (1781): 229-328.",
  "details": "Benjamin Thompson (Count Rumford) uses a double pendulum to determine muzzle velocities.  In addition to using the ballistic pendulum, he calculates muzzle velocity from the gun pendulum by taking the different in the distance of recoil with a bullet and without (using the same powder charge), and multiplying this value by a constant he has determined for the pendulum geometry and mass of the bullet.\n",
  "key": "thompson1781",
  "ref": "Thompson, 1781",
  "summary": "Count Rumford uses a ballistic pendulum to determine how the position of the vent effects muzzle velocity."
 },
 "tromenec1873": {
  "cms": "Tromenec, M. de. \"Sur un moyen de comparer poudres entre elles,\" <i>Comptes Rendus Hebdomadaires des Séances de l'Académie des Sciences,</i> LXXVII (1873): 126-128.",
  "key": "tromenec1873",
  "ref": "Tromenec, 1873",
  "summary": "Force of power measured via calorimeter."
 },
 "west1991": {
  "cms": "West, Jenny.  <i>Gunpowder, Government and War in the Mid-Eighteenth Century.</i>  Woodbridge: The Boydell Press, 1991.",
  "key": "west1991",
  "ref": "West, 1991",
  "summary": "An examination of the gunpowder trade in England."
 }
}