{
 "adye1804": {
  "cms": "Adye, Ralph Willet.  <i>The Bombardier, and Pocket Gunner.</i>  Boston: E. Larkin, 1804.",
  "key": "adye1804",
  "ref": "Adye, 1804",
  "summary": "An alphabetical listing of information, largely compiled from sources at Woolwich."
 },
 "anderson1696": {
  "cms": "Anderson, Robert. <i>The Making of Rockets.</i>  London: Printed for Robert Morden, 1696",
  "details": "<p>This short book is mostly concerned with making rockets and calculating distances and trajectories.  It includes information on how to pack them and to make pyrotechnic stars.</p>\n<p>There is a short section on firing mortars, where the units are not specified very well.  My assumption is that some of the charges are in ounces avoirdupois, and that some of the others are in drams avoirdupois.  This seems appropriate from context, and the calculated power factors seem in line with other tests.  The distances are marked \"Chain\", but I presume them to be in links, not whole chains.</p>",
  "key": "anderson1696",
  "ref": "Anderson, 1696",
  "summary": "Mostly a book on rockets, this also has some information on firing mortars."
 },
 "anderson1862": {
  "cms": "Anderson, Colonel William and Lieutenant-Colonel Samuel Parlby. <i>Sketch of the mode of manufacturing gunpowder at the Ishapore mills in Bengal.</i> London: John Weale, 1862",
  "details": "<p>This book has fairly thorough details of the gunpowder mills in Ishapore.  Much of the work examines manufacturing parameters and how they effect the quality of the resulting gunpowder.</p>\n<p>Anderson gives pendulum eprouvette values for nearly all of the tests.  However, he mentions (p. 294) that \"The weight of the gun, length of the arms, centre of gravity, diameter of bore, and oscillation, are all elements in the calculation, and if these be not the same, not two \\u00e9pouvettes will give an equal arc with the same charge of powder.\"  He then goes on to say that he thinks a single eprouvette will give consistent results, but doesn't include the pertinent information for his eprouvette to allow calculation of power based on it.</p>",
  "key": "anderson1862",
  "ref": "Anderson, 1862",
  "summary": "An excellent review of the technology used in India."
 },
 "berthelot1872": {
  "cms": "Berthelot, Marcelin.  <i>Sur la force de la poudre et matière explosives, Deuxième Édition</i>  Paris: Gauthier-Villars, 1872.",
  "key": "berthelot1872",
  "ref": "Berthelot, 1872",
  "summary": "A chemical analysis of explosives with some measurements of released heat."
 },
 "berthelot1892": {
  "cms": "Berthelot, M., C. Napier Hake, trans., and William MacNab, trans.  <i>Explosives and Their Power: translated and condensed from the French of M. Berthelot.</i>  London: John Murray, 1892.",
  "key": "berthelot1892",
  "ref": "Berthelot, 1892",
  "summary": "A chemical analysis of explosives with some measurements of released heat."
 },
 "blondel1683": {
  "cms": "Blondel. <i>L'Art de Jetter les Bombes.</i>  Paris: Nicholas Langlois: 1683",
  "key": "blondel1683",
  "ref": "Blondel, 1683",
  "summary": "A book on throwing shells comparing various ballistic theories."
 },
 "bohn1988": {
  "cms": "Bohn, Dennis A. \"Environmental Effects on the Speed of Sound.\" <i>Journal of the Audio Engineering Society.</i> 36, no. 4 (April, 1988): 223-231.",
  "key": "bohn1988",
  "link": "http://www.rane.com/pdf/eespeed.pdf",
  "ref": "Bohn, 1988",
  "summary": "Used to calculate the speed of sound based on temperature and relative humidity."
 },
 "braddock1832": {
  "cms": "Braddock, John.  <i>A Memoir on Gunpowder; in which are distilled the Principles both of its Manufacture and Proof.</i>  London: J. M. Richardson, 1832.",
  "key": "braddock1832",
  "ref": "Braddock, 1832",
  "summary": "An account of gunpowder manufacture at Madras."
 },
 "buchanan1996": {
  "cms": "Buchanan, Brenda J.  <i>Gunpowder: The History of an International Technology. Claverton Down,</i> Bath: Bath University Press, 1996.",
  "key": "buchanan1996",
  "ref": "Buchanan, 1996",
  "summary": "A report of comparing copper and wooden barrels from 1815."
 },
 "buchanan2006": {
  "cms": "Buchanan, Brenda, editor.  <i>Gunpowder, Explosives, and the State: A Technological History.</i>  Aldershot: Ashgate Publishing Limited, 2006",
  "key": "buchanan2006",
  "ref": "Buchanan, 2006",
  "summary": "A series of 20 essays on gunpowder."
 },
 "carmichael2003": {
  "cms": "Carmichael, Ralph. \"Trajectory of a baseball.\" Last modified February 7, 2003. http://www.pdas.com/programs/bb.f90",
  "key": "carmichael2003",
  "link": "http://www.pdas.com/atmos.html",
  "ref": "Carmichael, 2003",
  "summary": "I downloaded this program in 2003 and used it as an initial reference in calculating aerodynamic drag on spheres."
 },
 "chicago1993": {
  "cms": "University of Chicago Press. <i>The Chicago Manual of Style - 14th Edition.</i> Chicago: The University of Chicago Press, 1993.",
  "key": "chicago1993",
  "link": "http://www.chicagomanualofstyle.org/tools_citationguide.html",
  "ref": "Chicago, 1993",
  "summary": "I defer to the 14th edition that I own when in doubt, since I own a copy"
 },
 "clarke1891": {
  "cms": "Clarke, F. W.  <i>Weights, Measures, and Money, of All Nations.</i>  New York: D. Appleton and Company: 1891.",
  "key": "clarke1891",
  "ref": "Clarke, 1891"
 },
 "collins2016": {
  "cms": "Collins, A. R. <i>SphereDrag.  Calculation of aerodynamic drag coefficient for a sphere at speeds near the speed of sound.</i>  Accessed April 29, 2016.  http://arc.id.au/CannonballDrag.html",
  "key": "collins2016",
  "link": "http://arc.id.au/CannonballDrag.html",
  "ref": "Collins, 2016",
  "summary": "This is a javascript program that calculates drag based on Reynolds and Mach numbers based on the paper from Miller.  It is a different implementation than I created and gives slightly different results."
 },
 "dantoni1765": {
  "cms": "d'Antoni, Alessandro Vittorio Papacino.  <i>Esame Della Polvere,</i> Torino: Nella Stamperia Reale, 1765.",
  "key": "dantoni1765",
  "ref": "d'Antoni, 1765",
  "summary": "A treatise on gunpowder and how it works chemically and physically."
 },
 "dantoni1780": {
  "cms": "d'Antoni, Alessandro Vittorio Papacino.  <i>Dell'Uso Delle Armi Da Fuoco,</i> Torino: Nella Stamperia Reale, 1780.",
  "key": "dantoni1780",
  "ref": "d'Antoni, 1780",
  "summary": "A treatise on fire arms."
 },
 "dantoni1789": {
  "cms": "d'Antoni, Alessandro Vittorio Papacino and Captain Thompson, trans.  <i>A Treatise on Gun-powder; a Treatise on Firearms; and a Treatise on the Service of Artillery in Time of War,</i> London: T. and J. Egerton, 1789.",
  "key": "dantoni1789",
  "ref": "d'Antoni, 1789",
  "summary": "A translation of three earlier works from the Italian."
 },
 "diderot1751": {
  "cms": "Diderot and d'Alembert, ed. <i>Encyclopédie, ou Dictionanaire Raisonné des Sciences, des Arts et des Métiers, par une Société de Gens de Lettres.</i> Paris: Briasson, David, Le Breton, Durand: 1751",
  "key": "diderot1751",
  "link": "http://encyclopedie.uchicago.edu/",
  "ref": "Diderot, 1751",
  "summary": "This is an amazing compendium of knowledge.  It is one of the few mostly original encyclopedias."
 },
 "engineeringtoolbox": {
  "cms": "\"Metals and Alloys - Densities.\" Metals and Alloys - Densities. Accessed February 19, 2013. http://www.engineeringtoolbox.com/metal-alloys-densities-d_50.html.",
  "key": "engineeringtoolbox",
  "link": "http://www.engineeringtoolbox.com/metal-alloys-densities-d_50.html",
  "ref": "Engineering Toolbox",
  "summary": "A list of common material densities."
 },
 "gentlemans1740": {
  "cms": "Urban, Slyvanus.  \"Historical Chronical, Friday, 20\" <i>The Gentleman's Magazine and Historical Chronical</i>, 10, no. 6 (June 1740): 315.",
  "key": "gentlemans1740",
  "link": "http://www.bodley.ox.ac.uk/cgi-bin/ilej/image1.pl?item=page&seq=4&size=1&id=gm.1740.6.x.10.x.x.315",
  "ref": "Gentleman's Magazine, 1740",
  "summary": "Some captured Spanish gunpowder is compared to some English gunpowder that was reputed to be worse."
 },
 "hall1997": {
  "cms": "Hall, Bert S.  <i>Weapons and Warfate in Renaissance Europe.</i>  Baltimore: The John Hopkins Press, 1997",
  "key": "hall1997",
  "ref": "Hall, 1997",
  "summary": "A good description of the use of early gunpowder weapons in Europe."
 },
 "helene1878": {
  "cms": "Hélène, Maxime.  <i>La Poudre a Canon et les Nouveaux Corps Explosifs.</i>  Paris: Librarie Hachette et Cie., 1878",
  "key": "helene1878",
  "ref": "Helene, 1878",
  "summary": "An overview of a variety of explosives."
 },
 "helie1865": {
  "cms": "Hélie.  <i>Traité de Balistique Expérimentle.</i>  Paris: Librarie Militaire, 1865.",
  "key": "helie1865",
  "ref": "Hélie, 1878",
  "summary": "A discussion of ballistics effects."
 },
 "henderson1976": {
  "cms": "Henderson, Charles B.  \"Drag Coefficients of Spheres in Continuum and Rarefied Flows.\"  AIAA Journal.  14, no. 6 (1976): 707-708.",
  "key": "henderson1976",
  "link": "http://arc.aiaa.org/doi/abs/10.2514/3.61409?journalCode=aiaaj",
  "ref": "Henderson, 1976",
  "summary": "Some equations for drag on spheres."
 },
 "hime1897": {
  "cms": "Hime, H. W. L., <i>Stray Military Papers</i>, London: Longmans, Green, and Co., 1897",
  "key": "hime1897",
  "ref": "Hime, 1897",
  "summary": "This includes a chapter on field artillery and a section of proofs."
 },
 "hutton1778": {
  "cms": "Hutton, Charles.  \"The Force of Fired Gun-Powder, and the initial Velocities of Cannon Balls, determined by Experiments; from which is also deduced the Relation of the initial Velocity to the Weight of the short and the Quantity of Powder.\" <i>Philosophical Transactions of the Royal Society of London,</i>, 68 (1778): 50-85.",
  "key": "hutton1778",
  "ref": "Hutton, 1778",
  "summary": "Hutton's initial experiments with a ballistic pendulum."
 },
 "hutton1786": {
  "cms": "Hutton, Charles.  <i>Tracts, Mathematical and Philosophical.</i>  London: G. G. J. and J. Robinson, 1786",
  "key": "hutton1786",
  "ref": "Hutton, 1786",
  "summary": "Tract IX here is repeated in the 1812 multi-volume work as Tract XXXIV.  The data is recorded under those volumes, and therefore is skipped here."
 },
 "hutton1812v2": {
  "cms": "Hutton, Charles.  <i>Tracts on Mathematical and Philosophical Subjects, Vol. II.</i>  London: F. C. and J Rivington, et al., 1812",
  "key": "hutton1812v2",
  "ref": "Hutton, 1812, Vol. II",
  "summary": "Tract XXXIV: New Experiments in Gunnery; for Determining the Force of Fired Gunpowder, the initial velocity of cannon balls, the ranged of projectiles at different elevations, the resistance of air to projectiles, the effect of different lengths of guns, and of different quantities of powder, &c, &c."
 },
 "hutton1812v3": {
  "cms": "Hutton, Charles.  <i>Tracts on Mathematical and Philosophical Subjects, Vol. III.</i>  London: F. C. and J Rivington, et al., 1812",
  "key": "hutton1812v3",
  "ref": "Hutton, 1812, Vol. III",
  "summary": "Tract XXXIV, continued.  Tract XXXV: On a new Gunpowder Eprouvette.  Tract XXXVI: Determination of the Air's Resistance to Bodies in motion, as determined by the Whirling Machine.  Tract XXXVII: On the theory and Practice of Gunnery, as dependent on the Resistance of the Air."
 },
 "hutton1815v1": {
  "cms": "Hutton, Charles.  <i>A Philosophical and Mathematical Dictionary, Vol. I</i>  London: F. C. and J Rivington, et al., 1815",
  "key": "hutton1815v1",
  "ref": "Hutton, 1815",
  "summary": "A lengthy series of articles.  That on Gunnery contains some decent historical notes and a summary table of a some experiments.  Volume II (p. 561) contains a table comparing results fro ma double pendulum but without enough data to produce a useful computation."
 },
 "international1909": {
  "cms": "VIIth International Congress of Applied Chemistry, Explosives Section, <i>The Rise and Progress of the British Explosives Industry.</i>  London: Whittaker and Co.: 1909",
  "key": "international1909",
  "ref": "International Congress, 1909",
  "summary": "A history of the explosives industry with a chapter about researches on gunpowder by G. W. MacDonald."
 },
 "kadoya1985": {
  "cms": "Kadoya, K., N. Matsunaga, and A. Nagashima. \"Viscosity and Thermal Conductivity of Dry Air in the Gaseous Phase.\" <i>Journal of Physical and Chemical Reference Data.</i> 14, no. 4 (1985): 947-970.",
  "key": "kadoya1985",
  "link": "http://www.nist.gov/data/PDFfiles/jpcrd283.pdf",
  "ref": "Kadoya, 1985",
  "summary": "Used to determine the viscosity of dry air."
 },
 "kempers1998": {
  "cms": "Kempers, R. T. W., <i>Eprouvettes: A Comprehensive Study if Early Devices for the Testing of Gunpowder</i>, Leeds: Royal Armouries Museum, 1998.",
  "key": "kempers1998",
  "ref": "Kempers, 1998",
  "summary": "A well-produced study of eprouvettes."
 },
 "krenn1995": {
  "cms": "Krenn, Peter; Kalaus, Paul; Hall, Bert.  \"Material Culture and Military History: Test-Firing Early Modern Small Arms.\" <i>Material Culture Review / Revue de la culture matérielle, [S.l.], June 1995</i>.  ISSN 1927-9264.  Accessed: August 27, 2016.  https://journals.lib.unb.ca/index.php/MCR/article/view/17669/22312",
  "key": "krenn1995",
  "ref": "Krenn, 1995",
  "summary": "Ballistics tests with early weapons using modern gunpowder."
 },
 "lewes1920": {
  "cms": "Lewes, Vivian B. and J. S. S. Brame.  <i>Service Chemistry, being a short manual of chemistru and metallurgy and their application in the naval and military service.</i>  London: Edward Arnold, 1920.",
  "key": "lewes1920",
  "ref": "Lewes, 1920",
  "summary": "A few calorimeter results are listed."
 },
 "meigs1883": {
  "cms": "Meigs, Lieutenant U.S.N, translated from Sarrau, M. E. <i>Theoretical Researches on the Effects of Gunpowder and Other Explosives</i>  Washington: Government Printing Office, 1882.",
  "key": "meigs1883",
  "ref": "Meigs, 1883",
  "summary": "Mostly calculated values with a few results from calorimeters."
 },
 "melling1997": {
  "cms": "Melling, Adrian, Stefan Noppenberger, Martin Still, and Holger Venzke. \"Interpolation Correlations for Fluid Properties of Humid Air in the Temperature Range 100 C to 200 C.\" <i>Journal of Physical and Chemical Reference Data.</i> 26, no. 4 (1997): 1111-1123.",
  "key": "melling1997",
  "link:": "http://www.nist.gov/data/PDFfiles/jpcrd526.pdf",
  "ref": "Melling, 1997",
  "summary": "The contains the equation used to combine the viscosities of dry air and water vapor to determine the viscosity of humid air."
 },
 "miller1979": {
  "cms": "Miller, Donald G., and Allan B. Bailey. \"Sphere drag at Mach numbers from 0.3 to 2.0 at Reynolds Numbers approaching 10^7.\" <i>Journal of Fluid Mechanics.</i> 93, no. 3 (1979): 449-464.",
  "key": "miller1979",
  "ref": "Miller, 1979",
  "summary": "This is the best source I found for coefficient of drag based on Reynolds and Mach numbers in the range of typical projectiles."
 },
 "montagu1792": {
  "cms": "Montagu, George, <i>The Sportsman's Directory, or Tractate on Gunpowder</i>, London: R. Faulder, 1792",
  "key": "montagu1792",
  "ref": "Montagu, 1792",
  "summary": "The author tests different powders with the desire to find the best sporting powder."
 },
 "mordecai1845": {
  "cms": "Mordecai, Alfred, <i>Report of Experiments on Gunpowder, made at Washington Arsenal, in 1843 and 1844</i>, Washington: J. and G. S. Gideon, 1845.",
  "key": "mordecai1845",
  "ref": "Mordecai, 1845",
  "summary": "The first of two large sets of experiments on gunpowder."
 },
 "mordecai1849": {
  "cms": "Mordecai, Alfred, <i>Second Report of Experiments on Gunpowder, made at Washington Arsenal, in 1845, '47, and '48</i>, Washington: J. and G. S. Gideon, 1849.",
  "key": "mordecai1849",
  "ref": "Mordecai, 1849",
  "summary": "The second of two large sets of experiments on gunpowder."
 },
 "morrison2013": {
  "cms": "Morrison, Faith A.  <i>Data Correlation for Drag Coefficient for Sphere.</i>  Accessed April 29, 2016.  http://www.chem.mtu.edu/~fmorriso/DataCorrelationForSphereDrag2013.pdf",
  "key": "morrison2013",
  "link": "http://www.chem.mtu.edu/~fmorriso/DataCorrelationForSphereDrag2013.pdf",
  "ref": "Morrison, 2013",
  "summary": "This has an equation for the Coefficient of drag based on the Reynolds number, but it only applies at low speeds."
 },
 "munson1998": {
  "cms": "Munson, Bruce R., Donald F. Young, and Theodore H. Okiishi. <i>Fundamentals of Fluid Mechanics, Third Edition.</i> New York: John Wiley & Sons, Inc., 1998.",
  "key": "munson1998",
  "ref": "Munson, 1998",
  "summary": "A general text book."
 },
 "noble1875": {
  "cms": "Noble, Captain, and F. A. Abel,  \"Researches on Explosives.  Fired Gunpowder.\" <i>Philosophical Transactions of the Royal Society of London</i>, Vol. 165 (1875): 49-155.",
  "key": "noble1875",
  "ref": "Noble, 1875",
  "summary": "Analysis of gunpowder force and chemistry."
 },
 "noble1880": {
  "cms": "Noble, Captain, and F. A. Abel,  \"Researches on Explosives.  No. II.  Fired Gunpowder.\" <i>Philosophical Transactions of the Royal Society of London</i>, Vol. 171 (1880): 203-279.",
  "key": "noble1880",
  "ref": "Noble, 1880",
  "summary": "Analysis of gunpowder force and chemistry."
 },
 "norwest2001": {
  "cms": "\"Practical Chronographic Comparison of Goex, KIK and Elephant Brand of Black Powder.\" Comparing Goex, KIK and Elephant Brands of Black Powder. Accessed February 28, 2005. http://www.norwestcompany.com/comparison.htm.",
  "key": "norwest2001",
  "link": "http://www.norwestcompany.com/comparison.htm",
  "ref": "Norwest, 2001",
  "summary": "A modern comparison of different brands of black powder used in smoothbore and rifle longarms."
 },
 "parish1977": {
  "cms": "Parish, O. Owen and Terril W. Putnam. <i>Equations for the Determination of Humidity from Dewpoint and Psychrometric Data.</i>  Washington, D.C.: National Aeronautics and Space Administration, 1977.",
  "key": "parish1977",
  "ref": "Parish, 1977",
  "summary": "Equations for calculating humidity."
 },
 "partington1999": {
  "cms": "Partington, J. R., <i>A History of Greek Fire and Gunpowder</i>, Baltimore: The Johns Hopkins University Press, 1999.",
  "key": "partington1999",
  "ref": "Partington, 1999",
  "summary": "Originally published in 1960, this work has copious information, though many of the references are to the author's own publications, making the quality of them hard to evaluate."
 },
 "picard2008": {
  "cms": "Picard, A., R. S. Davis, M. Gläser, and K. Fujii. \"Revised formula for the density of moist air (CIPM-2007).\" <i>Metrologia.</i> 45 (2008): 149-155.",
  "key": "picard2008",
  "link": "http://stacks.iop.org/Met/45/149",
  "ref": "Picard, 2008",
  "summary": "A good summary of the errors in computing atmospheric density while taking humidity into account."
 },
 "report1742": {
  "cms": "Committee of the Royal Society. \"Report of the Committee of the Royal Society appointed to examine some Questions in Gunnery.\" <i>Philosophical Transactions of the Royal Society</i>, XVII, no. 465 (October and November 1742): 172-183.",
  "key": "report1742",
  "link": "http://rstl.royalsocietypublishing.org/content/by/year",
  "ref": "Committee of the Royal Society, 1742",
  "summary": "The committee analyzes how much gunpowder remains unburnt after firing and what effect chamber length has on range."
 },
 "robertson1775": {
  "cms": "Robertson, John, <i>A Treatise of Mathematical Instruments</i>, originally published London: printed for J. Nourse, 1775, reprinted by Arlington, VA: The Invisible College Press, 2002.",
  "key": "robertson1775",
  "ref": "Robertson, 1775",
  "summary": "Textbook problems with an unrealistic starting condition."
 },
 "sengers1984": {
  "cms": "Sengers, J. V. and B. Kamgar-Parsi. \"Representative Equations for the Viscosity of Water Substance.\" <i>Journal of Physical and Chemical Reference Data. 13, no. 1 (1984): 185-205.</i>",
  "key": "sengers1984",
  "link": "http://www.nist.gov/data/PDFfiles/jpcrd243.pdf",
  "ref": "Sengers, 1984",
  "summary": "Used to determine the viscosity of water vapor."
 },
 "smith1779": {
  "cms": "Smith, George.  <i>An Universal Military Dictionary,</i>  London: J. Millan, 1779",
  "key": "smith1779",
  "ref": "Smith, 1779",
  "summary": "Many miltary subjects are discussed in brief.  The section on gunnery has a summary of Robins ballistic pendulum work."
 },
 "steele2005": {
  "cms": "Steele, Brett D. and Tamera Dorland, editors.  <i>The Heirs of Archimedes: Science and the Art of War through the Age of Enlightenment.</i>  Cambridge: The MIT Press, 2005.",
  "key": "steele2005",
  "ref": "Steele, 2005",
  "summary": "A series of 13 essays, 3 of which are on gunpowder."
 },
 "steerk1866": {
  "cms": "Steerk, <i>Guide Pratique de la Fabrication des Poudres et Salpêters</i>.  Paris: Libraire de la Société des Ingénieurs Civils, 1866",
  "key": "steerk1866",
  "ref": "Steerk, 1866",
  "summary": "This work discusses many aspects of making gunpowder, all the way from refining ingredients to proof."
 },
 "stone1758": {
  "cms": "Stone, Edmund, <i>The Construction and Principal Uses of Mathematical Instruments, translated from the French of M. Bion</i>, originally published Lonndon: printed for J. Richardson, 1758, reprinted by Mendham, NJ: Astragal Press, 1995.",
  "key": "stone1758",
  "ref": "Stone, 1758",
  "summary": "Many conversion factors for lengths of different locations in Europe."
 },
 "straith1850": {
  "cms": "Straith, Hector, <i>Treatise on Fortification and Artillery</i>, London: W. Allen and Company, 1850.",
  "key": "straith1850",
  "ref": "Straith, 1850",
  "summary": "Observations based on the author's experience in India."
 },
 "stremy1745": {
  "cms": "Saint-Remy, Surirey de. <i>Memoires d'Artillerie, Troisiéme Edition.</i> Paris: Charles-Antoine Jombert, 1745.",
  "key": "stremy1745",
  "ref": "Saint-Remy, 1745",
  "summary": "An amazing compendium listing how to make and refine saltpetre, giving dimensions of stamp mills, and good details on the whole of the manufacturing."
 },
 "stremy1745v2": {
  "cms": "Saint Remy, M. Surirey de, <i>Memoires d'Artillerie, Recuellís par M. Surirey de Saint Remy, Lieutenant du Grand-Maítre de l'Artillerie de France.  Troisiíme Edition, Tome Second.</i>, Pais: Chez Rollin Fils, 1745.",
  "key": "stremy1745v2",
  "ref": "Saint Remy, 1745, Vol. II",
  "summary": "A complete summary of artillery in France."
 },
 "subramanian2005": {
  "cms": "Subramanian, R. Shankar. <i>Drag on spherical particles and steady settling velocities.</i> Accessed February 7, 2005.  http://web2.clarkson.edu/projects/subramanian/ch330/notes/Drag%20on%20a%20Sphere.pdf",
  "key": "subramanian2005",
  "link": "http://web2.clarkson.edu/projects/subramanian/ch330/notes/Drag%20on%20a%20Sphere.pdf",
  "ref": "Subramanian, 2005"
 },
 "thompson1781": {
  "cms": "Thompson, Benjamin.  \"New Experiments upon Gun-Powder, with Occasional Observations and Practical Inferences; To Which are Added, an Account of a New Method of Determining the Velocities of All Kinds of Military Projectiles, and the Description of a Very Accurate Eprouvette for Gun-Poweder.\" <i>Philosophical Transactions of the Royal Society of London,</i>, 71 (1781): 229-328.",
  "key": "thompson1781",
  "ref": "Thompson, 1781",
  "summary": "Count Rumford uses a ballistic pendulum to determine how the position of the vent effects muzzle velocity."
 },
 "west1991": {
  "cms": "West, Jenny.  <i>Gunpowder, Government and War in the Mid-Eighteenth Century.</i>  Woodbridge: The Boydell Press, 1991.",
  "key": "west1991",
  "ref": "West, 1991",
  "summary": "An examination of the gunpowder trade in England."
 }
}